# 삼성전자와 현대자동차 주가로 삼성전자 주가 맞추기
# 각각 데이터에서 컬럼 7개 이상 추출(그 중 거래량은 반드시 들어갈 것)
# timesteps와 feature는 알아서 잘라.
# 제공된 데이터 외 추가 데이터 사용금지
# 삼성전자 28일(화) 종가 맞추기 (점수배점 0.3)
# 삼성전자 29일(수) 아침 시가 맞추기 (점수배점 0.7) y한칸 건너 뛰어서
#메일 제출
#메일 제목: 김대진 [삼성 1차] 60,350.07원
#메일 제목: 김대진 [삼성 2차] 60,350.07원
#첨부 파일: keras53_samsung2_kdj_submit.py
#첨부 파일: keras54_samsung4_kdj_submit.py
#가중치: _save/samsung/keras53_samsung2_kdj.h5/hdf5
#가중치: _save/samsung/keras53_samsung4_kdj.h5/hdf5
#오늘밤 23:59분 1차 23일(월) 23시59분 59초 / 28일(화) 23시 59분 59초
